bench/results/20260715T231135Z/litellm.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/quentindequelen/Projects/Meilisearch/_side_projects/Lumen/.claude/worktrees/hungry-lalande-973b27/bench/k6-added-latency.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m0s max duration (incl. graceful stop):
              * load: 50 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
load   [   3% ] 50 VUs  01.0s/30s

running (0m02.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
load   [   7% ] 50 VUs  02.0s/30s

running (0m03.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
load   [  10% ] 50 VUs  03.0s/30s

running (0m04.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
load   [  13% ] 50 VUs  04.0s/30s

running (0m05.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
load   [  17% ] 50 VUs  05.0s/30s

running (0m06.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
load   [  20% ] 50 VUs  06.0s/30s

running (0m07.0s), 50/50 VUs, 48 complete and 0 interrupted iterations
load   [  23% ] 50 VUs  07.0s/30s

running (0m08.0s), 50/50 VUs, 177 complete and 0 interrupted iterations
load   [  27% ] 50 VUs  08.0s/30s

running (0m09.0s), 50/50 VUs, 298 complete and 0 interrupted iterations
load   [  30% ] 50 VUs  09.0s/30s

running (0m10.0s), 50/50 VUs, 442 complete and 0 interrupted iterations
load   [  33% ] 50 VUs  10.0s/30s

running (0m11.0s), 50/50 VUs, 555 complete and 0 interrupted iterations
load   [  37% ] 50 VUs  11.0s/30s

running (0m12.0s), 50/50 VUs, 676 complete and 0 interrupted iterations
load   [  40% ] 50 VUs  12.0s/30s

running (0m13.0s), 50/50 VUs, 840 complete and 0 interrupted iterations
load   [  43% ] 50 VUs  13.0s/30s

running (0m14.0s), 50/50 VUs, 954 complete and 0 interrupted iterations
load   [  47% ] 50 VUs  14.0s/30s

running (0m15.0s), 50/50 VUs, 1051 complete and 0 interrupted iterations
load   [  50% ] 50 VUs  15.0s/30s

running (0m16.0s), 50/50 VUs, 1111 complete and 0 interrupted iterations
load   [  53% ] 50 VUs  16.0s/30s

running (0m17.0s), 50/50 VUs, 1205 complete and 0 interrupted iterations
load   [  57% ] 50 VUs  17.0s/30s

running (0m18.0s), 50/50 VUs, 1316 complete and 0 interrupted iterations
load   [  60% ] 50 VUs  18.0s/30s

running (0m19.0s), 50/50 VUs, 1471 complete and 0 interrupted iterations
load   [  63% ] 50 VUs  19.0s/30s

running (0m20.0s), 50/50 VUs, 1637 complete and 0 interrupted iterations
load   [  67% ] 50 VUs  20.0s/30s

running (0m21.0s), 50/50 VUs, 1759 complete and 0 interrupted iterations
load   [  70% ] 50 VUs  21.0s/30s

running (0m22.0s), 50/50 VUs, 1871 complete and 0 interrupted iterations
load   [  73% ] 50 VUs  22.0s/30s

running (0m23.0s), 50/50 VUs, 2024 complete and 0 interrupted iterations
load   [  77% ] 50 VUs  23.0s/30s

running (0m24.0s), 50/50 VUs, 2173 complete and 0 interrupted iterations
load   [  80% ] 50 VUs  24.0s/30s

running (0m25.0s), 50/50 VUs, 2347 complete and 0 interrupted iterations
load   [  83% ] 50 VUs  25.0s/30s

running (0m26.0s), 50/50 VUs, 2531 complete and 0 interrupted iterations
load   [  87% ] 50 VUs  26.0s/30s

running (0m27.0s), 50/50 VUs, 2728 complete and 0 interrupted iterations
load   [  90% ] 50 VUs  27.0s/30s

running (0m28.0s), 50/50 VUs, 2904 complete and 0 interrupted iterations
load   [  93% ] 50 VUs  28.0s/30s

running (0m29.0s), 50/50 VUs, 3097 complete and 0 interrupted iterations
load   [  97% ] 50 VUs  29.0s/30s

running (0m30.0s), 50/50 VUs, 3305 complete and 0 interrupted iterations
load   [ 100% ] 50 VUs  30.0s/30s


  █ THRESHOLDS 

    http_req_duration
    ✗ 'p(99)<50' p(99)=6.49s


  █ TOTAL RESULTS 

    checks_total.......: 3358    111.264769/s
    checks_succeeded...: 100.00% 3358 out of 3358
    checks_failed......: 0.00%   0 out of 3358

    ✓ status is 200

    HTTP
    http_req_duration..............: avg=448.14ms min=177.71ms med=323.74ms max=7.01s p(90)=548.04ms p(95)=656.66ms p(99)=6.49s
      { expected_response:true }...: avg=448.14ms min=177.71ms med=323.74ms max=7.01s p(90)=548.04ms p(95)=656.66ms p(99)=6.49s
    http_req_failed................: 0.00%  0 out of 3358
    http_reqs......................: 3358   111.264769/s

    EXECUTION
    iteration_duration.............: avg=448.45ms min=177.73ms med=323.79ms max=7.02s p(90)=548.08ms p(95)=656.74ms p(99)=6.49s
    iterations.....................: 3358   111.264769/s
    vus............................: 50     min=50        max=50
    vus_max........................: 50     min=50        max=50

    NETWORK
    data_received..................: 4.7 MB 155 kB/s
    data_sent......................: 796 kB 26 kB/s



running (0m30.2s), 00/50 VUs, 3358 complete and 0 interrupted iterations
load ✓ [ 100% ] 50 VUs  30s