bench/results/20260715T231135Z/lumen.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/quentindequelen/Projects/Meilisearch/_side_projects/Lumen/.claude/worktrees/hungry-lalande-973b27/bench/k6-added-latency.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m0s max duration (incl. graceful stop):
              * load: 50 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
load   [   3% ] 50 VUs  01.0s/30s

running (0m02.0s), 50/50 VUs, 1623 complete and 0 interrupted iterations
load   [   7% ] 50 VUs  02.0s/30s

running (0m03.0s), 50/50 VUs, 4519 complete and 0 interrupted iterations
load   [  10% ] 50 VUs  03.0s/30s

running (0m04.0s), 50/50 VUs, 7583 complete and 0 interrupted iterations
load   [  13% ] 50 VUs  04.0s/30s

running (0m05.0s), 50/50 VUs, 10385 complete and 0 interrupted iterations
load   [  17% ] 50 VUs  05.0s/30s

running (0m06.0s), 50/50 VUs, 13475 complete and 0 interrupted iterations
load   [  20% ] 50 VUs  06.0s/30s

running (0m07.0s), 50/50 VUs, 15062 complete and 0 interrupted iterations
load   [  23% ] 50 VUs  07.0s/30s

running (0m08.0s), 50/50 VUs, 17552 complete and 0 interrupted iterations
load   [  27% ] 50 VUs  08.0s/30s

running (0m09.0s), 50/50 VUs, 19783 complete and 0 interrupted iterations
load   [  30% ] 50 VUs  09.0s/30s

running (0m10.0s), 50/50 VUs, 22311 complete and 0 interrupted iterations
load   [  33% ] 50 VUs  10.0s/30s

running (0m11.0s), 50/50 VUs, 24591 complete and 0 interrupted iterations
load   [  37% ] 50 VUs  11.0s/30s

running (0m12.0s), 50/50 VUs, 26595 complete and 0 interrupted iterations
load   [  40% ] 50 VUs  12.0s/30s

running (0m13.0s), 50/50 VUs, 29573 complete and 0 interrupted iterations
load   [  43% ] 50 VUs  13.0s/30s

running (0m14.0s), 50/50 VUs, 32154 complete and 0 interrupted iterations
load   [  47% ] 50 VUs  14.0s/30s

running (0m15.0s), 50/50 VUs, 35100 complete and 0 interrupted iterations
load   [  50% ] 50 VUs  15.0s/30s

running (0m16.0s), 50/50 VUs, 38193 complete and 0 interrupted iterations
load   [  53% ] 50 VUs  16.0s/30s

running (0m17.0s), 50/50 VUs, 41766 complete and 0 interrupted iterations
load   [  57% ] 50 VUs  17.0s/30s

running (0m18.0s), 50/50 VUs, 45010 complete and 0 interrupted iterations
load   [  60% ] 50 VUs  18.0s/30s

running (0m19.0s), 50/50 VUs, 48686 complete and 0 interrupted iterations
load   [  63% ] 50 VUs  19.0s/30s

running (0m20.0s), 50/50 VUs, 53374 complete and 0 interrupted iterations
load   [  67% ] 50 VUs  20.0s/30s

running (0m21.0s), 50/50 VUs, 56569 complete and 0 interrupted iterations
load   [  70% ] 50 VUs  21.0s/30s

running (0m22.0s), 50/50 VUs, 60097 complete and 0 interrupted iterations
load   [  73% ] 50 VUs  22.0s/30s

running (0m23.0s), 50/50 VUs, 62669 complete and 0 interrupted iterations
load   [  77% ] 50 VUs  23.0s/30s

running (0m24.0s), 50/50 VUs, 64916 complete and 0 interrupted iterations
load   [  80% ] 50 VUs  24.0s/30s

running (0m25.0s), 50/50 VUs, 67697 complete and 0 interrupted iterations
load   [  83% ] 50 VUs  25.0s/30s

running (0m26.0s), 50/50 VUs, 70307 complete and 0 interrupted iterations
load   [  87% ] 50 VUs  26.0s/30s

running (0m27.0s), 50/50 VUs, 72958 complete and 0 interrupted iterations
load   [  90% ] 50 VUs  27.0s/30s

running (0m28.0s), 50/50 VUs, 75708 complete and 0 interrupted iterations
load   [  93% ] 50 VUs  28.0s/30s

running (0m29.0s), 50/50 VUs, 79032 complete and 0 interrupted iterations
load   [  97% ] 50 VUs  29.0s/30s

running (0m30.0s), 50/50 VUs, 82363 complete and 0 interrupted iterations
load   [ 100% ] 50 VUs  30.0s/30s


  █ THRESHOLDS 

    http_req_duration
    ✗ 'p(99)<50' p(99)=220.56ms


  █ TOTAL RESULTS 

    checks_total.......: 82454   2733.543071/s
    checks_succeeded...: 100.00% 82454 out of 82454
    checks_failed......: 0.00%   0 out of 82454

    ✓ status is 200

    HTTP
    http_req_duration..............: avg=18.15ms min=480µs   med=9.43ms max=1.05s p(90)=23.02ms p(95)=36.57ms p(99)=220.56ms
      { expected_response:true }...: avg=18.15ms min=480µs   med=9.43ms max=1.05s p(90)=23.02ms p(95)=36.57ms p(99)=220.56ms
    http_req_failed................: 0.00% 0 out of 82454
    http_reqs......................: 82454 2733.543071/s

    EXECUTION
    iteration_duration.............: avg=18.27ms min=517.5µs med=9.52ms max=1.08s p(90)=23.16ms p(95)=36.77ms p(99)=220.64ms
    iterations.....................: 82454 2733.543071/s
    vus............................: 50    min=50         max=50
    vus_max........................: 50    min=50         max=50

    NETWORK
    data_received..................: 48 MB 1.6 MB/s
    data_sent......................: 20 MB 648 kB/s



running (0m30.2s), 00/50 VUs, 82454 complete and 0 interrupted iterations
load ✓ [ 100% ] 50 VUs  30s